Autodesk.Revit.DB.DWGExportOptions.GetPredefinedOptions(Autodesk.Revit.DB.Document,System.String)
Returns an instance DWGExportOptions containing settings from a predefined export setup.
document:
A Revit project document to retrieve the setup from.
setup:
The name of a predefined export setup from the specified document.
Returns:
An instance of predefined DWGExportOptions, or null if the name was not found.
Throws Autodesk.Revit.Exceptions.ArgumentException:
document is not a project document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.DWGExportOptions.#ctor(Autodesk.Revit.DB.DWGExportOptions)
Constructs a new instance of DWGExportOptions as a copy of the export options.
option:
The options to be copied.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null